/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   echo.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: vmamoten <vmamoten@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/12/10 14:25:20 by vmamoten          #+#    #+#             */
/*   Updated: 2024/12/22 14:50:19 by vmamoten         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../../include/minishell.h"

void	ft_echo(char **args, t_info *info)
{
	int i = 1;       // Начинаем с первого аргумента
	int newline = 1; // По умолчанию добавляем новую строку
	// Проверяем, является ли первый аргумент флагом -n
	while (args[i] && ft_strcmp(args[i], "-n") == 0)
	{
		newline = 0; // Если флаг -n найден, не добавляем новую строку
		i++;
	}
	// Вывод остальных аргументов
	while (args[i])
	{
		if (args[i][0] == '$' && ft_strlen(args[i]) > 1)
			// Если аргумент начинается с $
		{
			char *value = get_env_value(info, args[i] + 1);
				// Ищем переменную окружения
			if (value)
				printf("%s", value);
			else
				printf(""); // Если переменная не найдена, ничего не выводим
		}
		else
		{
			printf("%s", args[i]);
		}
		if (args[i + 1]) // Добавляем пробел между аргументами
			printf(" ");
		i++;
	}
	if (newline) // Добавляем новую строку, если флаг -n не был установлен
		printf("\n");
	info->exit_status = 0; // Устанавливаем статус выполнения
}
